/*
   Localizable.strings - Polish
   modizer

   Organized by screens and feature families
*/

// ================================
// MARK: - COMMON / GENERAL
// ================================

/* Common Actions */
"Yes" = "Tak";
"No" = "Nie";
"Ok" = "OK";
"Cancel" = "Anuluj";
"Close" = "Zamknij";
"Save" = "Zapisz";
"Delete" = "Usuń";
"Rename" = "Zmień nazwę";
"Extract" = "Rozpakuj";
"Cut" = "Wytnij";
"Paste" = "Wklej";
"Create" = "Utwórz";
"Reset" = "Resetuj";

/* Common States */
"Loading" = "Ładowanie";
"Extracting" = "Rozpakowywanie";
"Seeking" = "Przewijanie";
"Seeking %d%%" = "Przewijanie %d%%";
"Refreshing" = "Odświeżanie";
"Browsing" = "Przeglądanie";
"Cancelling..." = "Anulowanie...";

/* Common Messages */
"Error" = "Błąd";
"OK" = "OK";
"Warning" = "Ostrzeżenie";
"Do you want to reset to default value:\n" = "Czy chcesz przywrócić wartość domyślną:\n";


// ================================
// MARK: - BROWSER
// ================================

/* Browser Main Keys */
"Browser_LocalBrowsing_MainKey" = "Przeglądanie lokalne";
"Browser_LocalBrowsing_SubKey" = "Przeglądaj, odtwarzaj i usuwaj lokalne pliki.";

"Browser_MODLAND_MainKey" = "Kolekcja MODLAND";
"Browser_MODLAND_SubKey" = "%d plików do pobrania.";

"Browser_HVSC_MainKey" = "Kolekcja HVSC";
"Browser_HVSC_SubKey" = "%d plików do pobrania.";

"Browser_Playlists_MainKey" = "Listy odtwarzania";
"Browser_Playlists_SubKey" = "Organizuj, twórz, usuwaj i słuchaj.";

"Browser_Favorites_MainKey" = "Ulubione";
"Browser_Favorites_SubKey" = "Słuchaj ocenionych utworów.";

"Browser_Most_played_MainKey" = "Najczęściej odtwarzane";
"Browser_Most_played_SubKey" = "Słuchaj najczęściej odtwarzanych utworów.";

"Browser_Web_MainKey" = "Sieć";
"Browser_Web_SubKey" = "Przeglądaj Internet i pobieraj muzykę.";

"Browser_WorldCharts_MainKey" = "Światowe listy";
"Browser_WorldCharts_SubKey" = "Najlepsze listy i linki do pobrania.";

"Browser_WebVGM_MainKey" = "VGMRips";
"Browser_WebVGM_SubKey" = "Muzyka z gier wideo";

"Browser_UserGuide_MainKey" = "Podręcznik użytkownika";
"Browser_UserGuide_SubKey" = "Instrukcja, FAQ, wskazówki.";

/* Browser Display Modes */
"GetAllEntries_MainKey" = "Pobierz wszystkie brakujące wpisy";
"GetAllEntries_SubKey" = "Ograniczone do 256 pierwszych brakujących wpisów.";

"DisplayAll_MainKey" = "Lista wszystkich uporządkowana według nazwy";
"DisplayAll_SubKey" = "Bieżący katalog:";

"DisplayDir_MainKey" = "Lista/Katalog";
"DisplayDir_SubKey" = "Wszystkie uporządkowane według ścieżki:";

"DisplayAllPath_MainKey" = "Lista wszystkich uporządkowana według ścieżki";
"DisplayAllPath_SubKey" = "Wszystkie uporządkowane według nazwy:";

/* Browser View Modes */
"Formats/Artists/Files" = "Formaty/Artyści/Pliki";
"Artists/Formats/Files" = "Artyści/Formaty/Pliki";
"Artists/Files" = "Artyści/Pliki";
"Formats: %d entries." = "Formaty: %d wpisów.";
"Artists: %d entries." = "Artyści: %d wpisów.";

/* Browser Stats */
"Played %d times." = "Odtworzono %d razy.";
"Played once." = "Odtworzono raz.";
"Never played." = "Nigdy nie odtwarzano.";
"%d files." = "%d plików.";
"1 file." = "1 plik.";
"Size: %dKB" = "Rozmiar: %dKB";

/* Browser Messages */
"Browser not enough mem." = "Zbyt wiele wpisów, nie można przydzielić pamięci.";
"Browser not enough mem. Limited." = "Zbyt wiele wpisów, nie można przydzielić pamięci. Lista jest niekompletna.";

/* File Operations */
"New folder" = "Nowy folder";
"Enter folder name" = "Wprowadź nazwę folderu";
"Nothing to paste" = "Nie ma nic do wklejenia";
"No file to extract or not supported archive format.\n" = "Brak pliku do rozpakowania lub nieobsługiwany format archiwum.\n";
"Cannot use iCloud as folder name" = "Nie można użyć iCloud jako nazwy folderu";

"Issue %d while trying to delete entry.\n%@" = "Problem %d podczas próby usunięcia wpisu.\n%@";
"Issue %d while trying to renamefile.\n%@" = "Problem %d podczas próby zmiany nazwy pliku.\n%@";
"Issue %d while moving: %@.\n%@" = "Problem %d podczas przenoszenia: %@.\n%@";
"Issue %d while creating folder\n%@" = "Problem %d podczas tworzenia folderu\n%@";

"File is not available locally.\nTrigerring download from iCloud, please check in 'Files' application." = "Plik nie jest dostępny lokalnie.\nRozpoczynanie pobierania z iCloud, sprawdź w aplikacji 'Pliki'.";

"unavailable" = "niedostępny";

// ================================
// MARK: - SEARCH
// ================================

/* Search States */
"Playlist (%d)" = "Lista odtwarzania (%d)";
"Playlist/Search off" = "Lista odtwarzania/Szukanie wył.";

"Local (%d, limited to %d)" = "Lokalne (%d, ograniczone do %d)";
"Local (%d)" = "Lokalne (%d)";
"Local/Search off" = "Lokalne/Szukanie wył.";

"Modland (%d, limited to %d)" = "Modland (%d, ograniczone do %d)";
"Modland (%d)" = "Modland (%d)";
"Modland/Search off" = "Modland/Szukanie wył.";

"HVSC (%d, limited to %d)" = "HVSC (%d, ograniczone do %d)";
"HVSC (%d)" = "HVSC (%d)";
"HVSC/Search off" = "HVSC/Szukanie wył.";

"ASMA (%d, limited to %d)"="ASMA (%d, ograniczone do %d)";
"ASMA (%d)"="ASMA (%d)";
"ASMA/Search off"="ASMA/Szukanie wył.";

/* Search Messages */
"Searching Playlists..." = "Przeszukiwanie list odtwarzania...";
"Searching Local files..." = "Przeszukiwanie plików lokalnych...";
"Searching MODLAND..." = "Przeszukiwanie MODLAND...";
"Searching HVSC..." = "Przeszukiwanie HVSC...";

"Please enter at least 2 characters for your search." = "Wprowadź co najmniej 2 znaki do wyszukiwania.";
"Please activate at least 1 section for your search." = "Aktywuj co najmniej 1 sekcję do wyszukiwania.";


// ================================
// MARK: - PLAYER / NOW PLAYING
// ================================

/* Player States */
"Now playing" = "Teraz odtwarzane";
"Now playing(%d)" = "Teraz odtwarzane(%d)";
"Most played" = "Najczęściej odtwarzane";
"Favorites" = "Ulubione";
"Resuming last\nplayed file" = "Wznawianie ostatnio\nodtwarzanego pliku";

/* Player Controls */
"Previous" = "Poprzedni";
"Previous file" = "Poprzedni plik";
"Next file" = "Następny plik";
"Next" = "Następny";
"Shuffle" = "Losowo";
"Voices control" = "Kontrola głosów";
"All voices" = "Wszystkie głosy";
"Clear 'Now Playing' queue" = "Wyczyść kolejkę 'Teraz odtwarzane'";

/* Song Selection */
"Choose a subsong" = "Wybierz podtwór";
"Choose a song" = "Wybierz utwór";

/* Player Messages */
"Nothing currently playing. Please select a file." = "Nic obecnie nie jest odtwarzane. Wybierz plik.";
"File cannot be played. Skipping to next playable file." = "Nie można odtworzyć pliku. Przechodzę do następnego pliku.";
"Too much entries! Playlist will be limited to %d first entries." = "Zbyt wiele wpisów! Lista odtwarzania będzie ograniczona do %d pierwszych wpisów.";
"Playlist is full. Delete some entries to add more." = "Lista odtwarzania jest pełna. Usuń niektóre wpisy, aby dodać więcej.";

/* Metadata */
"unknown_title" = "Nieznany tytuł";
"unknown_album" = "Nieznany album";
"now_playing_format" = "Odtwarzanie: %@ z %@";


// ================================
// MARK: - PLAYLISTS
// ================================

/* Playlist Actions */
"New playlist" = "Nowa lista odtwarzania";
"Create new playlist" = "Utwórz nową listę odtwarzania";
"Save current one" = "Zapisz bieżącą";
"Rename playlist" = "Zmień nazwę listy odtwarzania";
"Add to a playlist" = "Dodaj do listy odtwarzania";
"Choose a playlist" = "Wybierz listę odtwarzania";

/* Playlist Descriptions */
"Create a new empty playlist." = "Utwórz nową pustą listę odtwarzania.";
"Create a playlist from currently played files." = "Utwórz listę odtwarzania z aktualnie odtwarzanych plików.";
"Browse files" = "Przeglądaj pliki";
"Add or remove entries from browser." = "Dodaj lub usuń wpisy z przeglądarki.";
"Choose a new name." = "Wybierz nową nazwę.";

/* Playlist Confirmations */
"Are you sure you want to delete this playlist ?" = "Czy na pewno chcesz usunąć tę listę odtwarzania?";
"Are you sure you want to delete this entry ?" = "Czy na pewno chcesz usunąć ten wpis?";


// ================================
// MARK: - DOWNLOADS
// ================================

"Downloads" = "Pobrane";
"Download queue: 1 file" = "Kolejka pobierania: 1 plik";
"Download queue: %d files" = "Kolejka pobierania: %d plików";
"No download in progress" = "Brak pobierania w toku";
"Downloaded %@" = "Pobrano %@";
"Downloading %@" = "Pobieranie %@";
"Cannot download from this URL." = "Nie można pobrać z tego adresu URL.";
"Could not add files. Please check manually with file browser (Local Browsing/Downloads)." = "Nie można dodać plików. Sprawdź ręcznie w przeglądarce plików (Przeglądanie lokalne/Pobrane).";
"File already available locally. Do you want to download it again?" = "Plik jest już dostępny lokalnie. Czy chcesz pobrać go ponownie?";
"URL have to start with ftp:// or http://" = "URL musi zaczynać się od ftp:// lub http://";
"Cannot connect to FTP." = "Nie można połączyć się z FTP.";


// ================================
// MARK: - DATABASE
// ================================

"Database created." = "Utworzono bazę danych.";
"Database will now be recreated. Please validate & wait." = "Baza danych zostanie teraz odtworzona. Potwierdź i poczekaj.";
"Wrong database version: %d.%d. Will update to %d.%d. Please validate & wait." = "Nieprawidłowa wersja bazy danych: %d.%d. Zostanie zaktualizowana do %d.%d. Potwierdź i poczekaj.";
"No database found. Will create a new one. Please validate & wait..." = "Nie znaleziono bazy danych. Zostanie utworzona nowa. Potwierdź i poczekaj...";


// ================================
// MARK: - COVERS / IMAGES
// ================================

"Image detected" = "Wykryto obraz";
"Choose_SaveCover" = "Zapisać obraz jako okładkę dla %@?";
"CoverFolder" = "Jako okładka folderu";
"CoverFile" = "Jako okładka pliku";
"Confirm_RemCurCovers" = "Usunąć bieżące okładki dla %@ (folder i plik)?";


// ================================
// MARK: - SETTINGS - GENERAL
// ================================

/* Settings Sections */
"Settings_General" = "Ogólne";
"Settings_Player" = "Odtwarzacz";
"Settings_Display" = "Wyświetlanie";
"Settings_Download" = "Pobieranie";
"Settings_FTP" = "FTP";
"Settings_PlaybackLib" = "Biblioteki odtwarzania";
"Settings_Settings" = "Ustawienia";

/* Settings Presets */
"Settings_SettingsDefault" = "Domyślne";
"Settings_SettingsHigh" = "Wysokie";
"Settings_SettingsMed" = "Średnie";
"Settings_SettingsLow" = "Niskie";

"Confirm_SettingsDef" = "Czy na pewno chcesz zresetować ustawienia do wartości 'domyślnych'?";
"Confirm_SettingsHigh" = "Czy na pewno chcesz zresetować ustawienia do wartości 'wysokich'?";
"Confirm_SettingsMed" = "Czy na pewno chcesz zresetować ustawienia do wartości 'średnich'?";
"Confirm_SettingsLow" = "Czy na pewno chcesz zresetować ustawienia do wartości 'niskich'?";

/* Global Player Settings */
"Search: simplified regexp ('.'->'\\.', '*'->'.*')" = "Szukaj: uproszczone wyrażenia regularne ('.'->'\\.', '*'->'.*')";
"Resume position on launch" = "Wznów pozycję przy uruchomieniu";
"Notification" = "Powiadomienie";
"Notification duration" = "Czas trwania powiadomienia";
"Disable screen auto lock" = "Wyłącz automatyczną blokadę ekranu";
"No screen auto lock" = "Brak automatycznej blokady ekranu";
"Enable playback ratio" = "Włącz współczynnik odtwarzania";
"Playback ratio" = "Współczynnik odtwarzania";
"Default length" = "Domyślna długość";
"Default length %d:%.2d" = "Domyślna długość %d:%.2d";
"Fade-out time" = "Czas wyciszania";
"Silence Detection" = "Wykrywanie ciszy";
"Stop song if silent for more than selected number of seconds. 0: off" = "Zatrzymaj utwór, jeśli cisza trwa dłużej niż wybrana liczba sekund. 0: wył.";
"Will skip song if nothing is played for specified duration (0=off)" = "Pominie utwór, jeśli nic nie jest odtwarzane przez określony czas (0=wył.)";
"Force mono" = "Wymuś mono";
"Panning" = "Panoramowanie";
"Panning value" = "Wartość panoramowania";
"Audio latency" = "Opóźnienie dźwięku";
"Audio latency in ms" = "Opóźnienie dźwięku w ms";
"Multi default action" = "Domyślna akcja wielokrotna";
"Browse" = "Przeglądaj";
"Archive/multi play mode" = "Tryb odtwarzania archiwum/wielokrotny";
"Entry"="Wpis";

/* Archive Settings */
"Archive multi default action" = "Domyślna akcja wielokrotna archiwum";
"Archive multi play mode" = "Tryb odtwarzania wielokrotnego archiwum";

/* Playlist Settings */
"Play/Enqueue action" = "Akcja Odtwórz/Kolejkuj";
"Enqueue mode" = "Tryb kolejkowania";
"Default Action" = "Domyślna akcja";
"Play" = "Odtwórz";
"Enqueue" = "Kolejkuj";
"Enq.&Play" = "Kolejkuj i odtwórz";
"First" = "Pierwszy";
"Current" = "Bieżący";
"Last" = "Ostatni";
"Enqueue position" = "Pozycja kolejkowania";
"Post download action" = "Akcja po pobraniu";
"Nothing" = "Nic";

/* Display Settings */
"Background mode" = "Tryb w tle";
"Partial" = "Częściowy";
"Full" = "Pełny";
"Off=no background process, Partial=keep playing music, Full=keep app on in background" = "Wył.=brak procesu w tle, Częściowy=kontynuuj odtwarzanie muzyki, Pełny=utrzymuj aplikację w tle";
"Long name truncate" = "Obcinanie długich nazw";
"Head" = "Początek";
"Mid." = "Środek";
"Tail" = "Koniec";
"Filename as title" = "Nazwa pliku jako tytuł";

/* Local Files Settings */
"Auto. restore Samples folder" = "Automatyczne przywracanie folderu Samples";
"Send statistics" = "Wysyłaj statystyki";


// ================================
// MARK: - SETTINGS - DATABASE
// ================================

"Settings_DB" = "Baza danych";
"Settings_CleanDB" = "Wyczyść bazę danych";
"Settings_ResetPlCnt" = "Resetuj liczniki odtworzeń";
"Settings_ResetRatings" = "Resetuj oceny";
"Settings_ResetDB" = "Resetuj całą bazę danych";

"Confirm_DBClean" = "Uruchomić czyszczenie bazy danych (może chwilę potrwać)?";
"Confirm_Reset_PlCnt" = "Czy na pewno chcesz zresetować wszystkie liczniki odtworzeń?";
"Confirm_Reset_Ratings" = "Czy na pewno chcesz zresetować wszystkie oceny?";
"Confirm_ResetDB" = "Czy na pewno chcesz zresetować całą bazę danych? Listy odtwarzania, oceny i liczniki zostaną usunięte.";


// ================================
// MARK: - SETTINGS - LOCAL FILES
// ================================

"Settings_LocalFiles" = "Pliki lokalne";
"Settings_RecreateSamples" = "Odtwórz folder 'Samples'";
"Settings_FormatDownloads" = "Formatuj folder 'Pobrane'";
"Settings_RemCovers" = "Usuń okładki";
"Settings_UpdateFilesBackupFlag" = "Sprawdź system plików";

"Confirm_RecreateSamples" = "Czy chcesz odtworzyć folder 'Samples'.";
"Confirm_FormatDownloads" = "Czy chcesz usunąć WSZYSTKIE pliki z folderu Przeglądanie lokalne/Sieć.";
"Confirm_CheckFiles" = "Czy chcesz przeprowadzić sprawdzanie lokalnego systemu plików?";


// ================================
// MARK: - SETTINGS - PLUGINS
// ================================

/* AdPlug */
"OPL type" = "Typ OPL";
"Stereo surround" = "Dźwięk przestrzenny stereo";

/* GBSPlay */
"HP filter type" = "Typ filtra HP";
"Highpass filter type" = "Typ filtra górnoprzepustowego";

/* Game Music Emu (GME) */
"Stereo separation" = "Separacja stereo";
"Ignore silence" = "Ignoruj ciszę";
"Silence detection" = "Wykrywanie ciszy";
"Equalizer" = "Korektor";
"Bass" = "Basy";
"Treble" = "Soprany";

/* GSF */
"Sound quality" = "Jakość dźwięku";
"Interpolation" = "Interpolacja";
"Low-pass filter" = "Filtr dolnoprzepustowy";
"Echo" = "Echo";

/* Highly Complete (HC) */
"Resample quality" = "Jakość resamplingu";
"Main enabled" = "Główne włączone";
"Reverb enabled" = "Pogłos włączony";

/* NSFPlay */
"NSFPLAY default length" = "Domyślna długość NSFPLAY";
"LPF strength" = "Siła LPF";
"Min=off, default: 112" = "Min=wył., domyślnie: 112";
"HPF strength" = "Siła HPF";
"Region" = "Region";
"VRC7 Patches" = "Łaty VRC7";
"Force IRQ" = "Wymuś IRQ";
"Quality" = "Jakość";

/* OpenMPT */
"Master volume" = "Głośność główna";
"Sampling" = "Próbkowanie";
"Resampling" = "Ponowne próbkowanie";

/* SID */
"Engine" = "Silnik";
"Filter" = "Filtr";
"Force loop" = "Wymuś pętlę";
"Clock" = "Zegar";
"Model" = "Model";
"Force 2nd SID" = "Wymuś 2. SID";
"Address 2nd" = "Adres 2.";
"0xD420-0xD7FF or 0xDE00-0xDFFF" = "0xD420-0xD7FF lub 0xDE00-0xDFFF";
"Force 3rd SID" = "Wymuś 3. SID";
"Address 3rd" = "Adres 3.";
"Start subsong" = "Uruchom podpiosenkę";
"Subsong start position: first one or the one specified in file's header" = "Pozycja startowa podpiosenki: pierwsza lub określona w nagłówku pliku";
"Header" = "Nagłówek";

/* Timidity */
"Max loop" = "Maks. pętla";
"MIDI polyphony" = "Polifonia MIDI";
"Amplification" = "Wzmocnienie";
"Chorus" = "Chór";
"Reverb" = "Pogłos";
"Resample" = "Resampling";
"LP filter" = "Filtr LP";

/* UADE */
"Headphones" = "Słuchawki";
"LED filter" = "Filtr LED";
"Normalization" = "Normalizacja";
"Post FX" = "Efekty końcowe";
"Panning" = "Panoramowanie";
"Panning value" = "Wartość panoramowania";
"Gain" = "Wzmocnienie";
"Gain value" = "Wartość wzmocnienia";
"Force NTSC" = "Wymuś NTSC";

/* VGMPlay */
"Prefer JTAG" = "Preferuj JTAG";
"YM2612 emulator" = "Emulator YM2612";
"Nuked OPN2 option" = "Opcja Nuked OPN2";
"YMF262 emulator" = "Emulator YMF262";
"YM3812 emulator" = "Emulator YM3812";
"QSound emulator" = "Emulator QSound";
"RF5C68 emulator" = "Emulator RF5C68";

/* VGMStream */
"Max loop" = "Maks. pętla";

/* XMP */
"Amiga 500 Filter" = "Filtr Amiga 500";


// ================================
// MARK: - SETTINGS - VISUALIZATIONS
// ================================

/* General FX */
"FX Alpha" = "Przezroczystość FX";
"FX Fullscreen" = "FX pełny ekran";
"FX FPS" = "FX FPS";
"FX show info" = "FX pokaż info";
"Tech Info" = "Info techniczne";
"Show FPS and other infos (CPU, Resolution, ProjectM audio data)" = "Pokaż FPS i inne informacje (CPU, rozdzielczość, dane audio ProjectM)";
"FX Level of details" = "Poziom szczegółów FX";
"Low" = "Niski";
"Med" = "Średni";
"High" = "Wysoki";
"Slow FX limit" = "Limit wolnych FX";
"Deactivate FX if too slow." = "Dezaktywuj FX, jeśli za wolne.";
"Weak" = "Słaby";
"Strong" = "Silny";
"Display song info" = "Wyświetl informacje o utworze";
"When in fulllscreen, display song info when it changes. TL is Top Left, DR is Bottom Right, C is Center." = "W trybie pełnoekranowym wyświetl informacje o utworze przy zmianie. TL to lewy górny róg, DR to prawy dolny, C to środek.";

/* ProjectM */
"ProjectM settings" = "Ustawienia ProjectM";
"ProjectM on/off" = "ProjectM wł./wył.";
"Show preset label" = "Pokaż etykietę presetu";
"Auto switch presets mode" = "Tryb automatycznej zmiany presetów";
"Lock preset" = "Zablokuj preset";
"Time between preset" = "Czas między presetami";
"Blend presets" = "Mieszaj presety";
"Blend time" = "Czas mieszania";
"Bundled presets" = "Presety dołączone";
"Custom presets" = "Presety własne";
"Aspect ratio" = "Proporcje obrazu";
"Mesh size X" = "Rozmiar siatki X";
"Mesh size Y" = "Rozmiar siatki Y";
"Hard cut enabled" = "Twarde cięcie włączone";
"Hard cut min time" = "Min. czas twardego cięcia";
"Hard cut sensitivity" = "Czułość twardego cięcia";
"Beat sensitivity" = "Czułość rytmu";
"Permissive mode" = "Tryb permisywny";

/* Oscilloscope */
"Oscillo settings" = "Ustawienia oscyloskopu";
"FX mode" = "Tryb FX";
"Show label" = "Pokaż etykietę";
"Label font size" = "Rozmiar czcionki etykiety";
"Show grid" = "Pokaż siatkę";
"Grid color" = "Kolor siatki";
"Line width" = "Szerokość linii";
"Mono color" = "Kolor mono";
"Multi color set" = "Zestaw kolorów wielobarwnych";
"Reset all colors" = "Resetuj wszystkie kolory";
"Thin" = "Cienka";
"Medium" = "Średnia";
"Thick" = "Gruba";
"Beefy" = "Bardzo gruba";

/* Piano Roll / MIDI */
"Piano roll" = "Piano roll";
"Activate Piano roll FX, standard or 'Synthesia' like" = "Aktywuj efekty Piano roll, standardowe lub typu 'Synthesia'";
"Activate spark FX, colored or white" = "Aktywuj efekty iskier, kolorowe lub białe";
"Display voices labels" = "Wyświetl etykiety głosów";
"Display octaves labels" = "Wyświetl etykiety oktaw";
"MIDI pattern" = "Wzór MIDI";
"MIDI cut line" = "Linia cięcia MIDI";
"MIDI bar style" = "Styl paska MIDI";
"MIDI bar vibrato" = "Vibrato paska MIDI";
"Piano 3D" = "Pianino 3D";
"Piano cut line" = "Linia cięcia pianina";
"Piano color mode" = "Tryb kolorów pianina";

/* Spectrum */
"3D spectrum" = "Spektrum 3D";
"3D spectrum bloom" = "Rozbłysk spektrum 3D";
"Spectrum" = "Spektrum";
"3D landscape" = "Krajobraz 3D";
"3D landscape bloom" = "Rozbłysk krajobrazu 3D";

/* MOD Pattern */
"MOD pattern" = "Wzór MOD";
"MOD pattern BG alpha" = "Przezroczystość tła wzoru MOD";
"MOD pattern vol bar" = "Pasek głośności wzoru MOD";
"MOD pattern current line mode" = "Tryb bieżącej linii wzoru MOD";
"MOD pattern font" = "Czcionka wzoru MOD";
"MOD pattern font size" = "Rozmiar czcionki wzoru MOD";
"MOD pattern theme" = "Motyw wzoru MOD";


// ================================
// MARK: - WEB BROWSER
// ================================

"Browser_Welcome_Message" = "<b>Witaj w przeglądarce internetowej Modizer!</b><br><br>Użyj paska adresu powyżej, aby nawigować lub przeglądać zakładki.<br><br>Aby użyć obrazu jako okładki, skopiuj go do schowka długim naciśnięciem (iOS) lub prawym kliknięciem (macOS).";
"Bookmarks" = "Zakładki";


// ================================
// MARK: - ABOUT
// ================================

"About_Text" = "v4.6 © Yohann Magnien / YoyoFR\n\nKontakt: mailto:modizerhelp@gmail.com\nSieć: https://modizer.app\n\nLogo Modizer autorstwa Steve Miele.\n\nLiczba obsługiwanych formatów/rozszerzeń plików: 1108.\n!PM!,003,04SW,208,2DX9,2PSF,2SF,2SFLIB,3DO,4,40A,40B,41A,4V,50A,60A,61A,669,800,9TAV,A2M,A2T,AAC,AAM,AAX,ABK,AC1,AC1D,ACB,ACM,ACX,ADL,ADLIB,ADM,ADP,ADPCM,ADPCMX,ADS,ADSC,ADW,ADX,AFC,AFS2,AGD,AGI,AGSC,AHV,AHX,AI,AIF,AIF-LOOP,AIFC,AIFCL,AIFF,AIFFL,AIX,AKB,AL,AL2,ALP,AMC,AMD,AMF,AMS,AMTS,AO,AON,AON4,AON8,AP,APC,APE,ARP,AS0,AS3M,AS4,ASC,ASD,ASF,ASR,ASS,AST,AT3,AT9,ATSL,ATSL3,ATSL4,ATX,AUD,AUS,AVAL,AVP,AWB,AWC,AY,B1S,BAF,BAKA,BAM,BANK,BAO,BAR,BCSTM,BCWAV,BD,BD3,BDS,BDSP,BFC,BFSTM,BFWAV,BFWAVNSMBU,BG00,BGM,BGW,BH2PCM,BIK,BIK2,BIKA,BIN,BK2,BLK,BMDX,BMF,BMS,BNK,BNM,BNS,BNSF,BO2,BP,BP3,BRSTM,BRSTMSPM,BSF,BSI,BSND,BSS,BTSND,BVG,BWAV,BYTES,C64,C67,CAF,CAPDSP,CBD2,CC3,CCC,CD,CFF,CFN,CHAN,CHI,CHK,CHP,CIN,CKB,CKD,CKS,CM,CM3,CMC,CMF,CMR,CMS,CNK,COP,CORE,CP,CPK,CPLX,CPS,CRB,CSB,CSMP,CTRL,CUS,CUST,CUSTOM,CVS,CWAV,CXS,D00,DA,DAT,DATA,DAX,DB,DBM,DCS,DCT,DDSP,DE2,DEC,DFM,DH,DI,DIGI,DIVA,DL,DLM1,DLM2,DLN,DLT,DL_DELI,DM0,DM1,DM2,DMC,DMF,DMM,DMO,DMSG,DMU,DMU2,DNS,DODA,DP,DR0,DRO,DS2,DSB,DSC,DSF,DSFLIB,DSM,DSP,DSPW,DSQ,DSR,DSS,DST,DSYM,DTK,DTM,DUM,DVI,DW,DWOLD,DXH,DZ,E4X,EA,EAM,EAS,EMFF,EMOD,EMS,EMSV6,ENM,ENO,ENS,ESV,ET1,EU,EUP,EX,EXA,EZW,FAG,FAR,FC,FC-BSI,FC-M,FC13,FC14,FC3,FC4,FCM,FDA,FDI,FFW,FILP,FLAC,FLX,FMB,FNK,FP,FRED,FSB,FST,FSV,FT,FTC,FUZ,FUZZ,FW,FWAV,FWSE,G1L,GAM,GAMPLUS,GBR,GBS,GBTS,GCA,GCM,GCUB,GCW,GDM,GENH,GIN,GLUE,GM,GMC,GMS,GOT,GRAY,GSB,GSF,GSFLIB,GT2,GTD,GTK,GTR,GV,GWM,GYM,H4M,HA2,HAB,HBT,HCA,HD,HDR,HES,HGC1,HIP,HIP7,HIPC,HIS,HMC,HN,HPS,HRM,HRP,HRT,HRT!,HSC,HSF,HSP,HSQ,HST,HVL,HWAS,HX2,HX3,HXC,HXD,HXG,HXX,IAB,IADP,ICE,IDMSF,IDSP,IDVI,IDWAV,IDXMA,IFS,IKM,ILD,IMA,IMC,IMF,IMS,IMX,INSTR,INS,INT,IS,IS14,IS20,ISB,ISD,ISWS,IT,IT1,ITL,IVAG,IVAUD,IVB,J2B,JAM,JBM,JC,JCB,JCBO,JD,JMF,JO,JOE,JP,JPN,JPND,JPO,JPOLD,JSTM,JT,KAT,KCES,KCEY,KEF,KEF7,KH,KM9,KNS,KOVS,KRAW,KRIS,KRS,KSM,KSS,KTAC,KTSL2ASBIN,KTSS,KVS,L,LAA,LAAC,LAIF,LAIFC,LAIFF,LASF,LAX,LBIN,LDS,LEG,LEP,LIN,LION,LIQ,LM0,LM1,LM2,LM3,LM4,LM5,LM6,LM7,LME,LMP3,LMP4,LOGG,LOPUS,LP,LPCM,LPK,LPS,LRMB,LSE,LSF,LSTM,LWAV,LZS,M,M15,M2,M3U,M4A,M4V,MA,MAB,MAD,MAP,MATX,MAX,MBM,MC,MC3,MCA,MCADPCM,MCG,MCMD,MCMD_ORG,MCO,MCR,MD,MDAT,MDI,MDL,MDS,MDSP,MDST,MDX,MDY,MED,MEXXMP,MFP,MG,MGS,MI4,MIB,MIC,MID,MIDI,MIHB,MINI2SF,MINIDSF,MINIGSF,MININCSF,MINIPSF,MINIPSF2,MINIQSF,MINISNSF,MINISSF,MINIUSF,MJB,MK2,MKF,MKII,MKIIO,MKJ,ML,MM4,MM8,MMCMP,MMD0,MMD1,MMD2,MMD3,MMD4,MMDC,MMS,MNSTR,MO3,MOD,MOD15,MOD15_MST,MOD15_ST-IV,MOD15_UST,MOD_ADSC4,MOD_COMP,MOD_DOC,MOD_FLT4,MOD_NTK,MOD_NTK1,MOD_NTK2,MOD_NTKAMP,MOGG,MOK,MON,MON_OLD,MP3,MP4,MPD,MPDSP,MPF,MPG,MPK,MPRO,MPT,MPTM,MS,MSA,MSADPCM,MSB,MSC,MSD,MSF,MSO,MSP,MSS,MSV,MSVP,MT2,MTA2,MTAF,MTK,MTM,MTP2,MTR,MUG,MUG2,MUL,MUPS,MUS,MUSC,MUSX,MW,MWV,MXST,MYSPD,MZ,N64,NAAC,NCSF,NCSFLIB,NDP,NDS,NGCA,NLSD,NOISEPACKER2,NOISEPACKER3,NOP,NP,NP1,NP2,NP3,NPS,NPSF,NR,NRU,NSF,NSFE,NSOPUS,NST,NTP,NTPK,NUB,NUB2,NUS3AUDIO,NUS3BANK,NWA,NWAV,NXA,OCTAMED,OGG,OGL,OKT,OKTA,OMU,ONE,OPI,OPUS,OPUSX,OPX,ORG,OSP,OSS,OTM,OVB,OVI,OXM,OZI,P,P00,P10,P21,P2BT,P30,P3D,P40A,P40B,P41A,P4X,P50A,P5A,P5X,P60,P60A,P61,P61A,P6X,P86,PAP,PAST,PCD,PCM,PDT,PDX,PFLT,PHA,PIN,PIS,PK,PLM,PLX,PM,PM0,PM01,PM1,PM10C,PM18A,PM2,PM20,PM4,PM40,PMB,PMZ,PNB,POLK,PONA,POS,POWT,PP10,PP20,PP21,PP30,PPC,PPK,PPM,PPS,PPZ,PR1,PR2,PRG,PROM,PRU,PRU1,PRU2,PRUN,PRUN1,PRUN2,PS,PS2STM,PSA,PSC,PSF,PSF2,PSF2LIB,PSFLIB,PSG,PSH,PSID,PSM,PSND,PSW,PT,PT1,PT2,PT3,PT36,PTCOP,PTM,PTTUNE,PUMA,PVI,PVP,PWR,PXA,PYG,PYGM,PYGMY,PZI,QC,QPA,QSF,QSFLIB,QTS,R,RAC,RAD,RAK,RAS,RAW,RH,RHO,RIFF,RIX,RJP,RK,RKB,RKV,RMT,RND,ROF,ROL,RPGMVO,RRDS,RSD,RSF,RSID,RSM,RSP,RSTM,RTM,RWAR,RWAV,RWS,RWSD,RWX,RXW,S-C,S14,S3M,S7G,S98,SA,SA-P,SA2,SAB,SAD,SAF,SAP,SAS,SAT,SA_OLD,SB,SB0,SB1,SB2,SB3,SB4,SB5,SB6,SB7,SBIN,SBK,SBR,SBV,SC,SC68,SCD,SCH,SCI,SCL,SCN,SCR,SCT,SCUMM,SD9,SDB,SDF,SDR,SDT,SEB,SED,SEG,SET,SF0,SF2,SFL,SFM,SFS,SFX,SFX13,SFX2,SG,SGB,SGC,SGD,SGX,SID,SID1,SID2,SJS,SKT,SKYT,SL3,SLI,SM,SM0,SM1,SM2,SM3,SM4,SM5,SM6,SM7,SMC,SMK,SMN,SMP,SMPL,SMPRO,SMUS,SMV,SND,SNDH,SNDMON,SNDS,SNG,SNGW,SNK,SNR,SNS,SNSF,SNSFLIB,SNT,SNT!,SNU,SNX,SOC,SOD,SOG,SON,SONGPLAY,SONIC,SOP,SPC,SPD,SPK,SPL,SPM,SPS,SPSD,SPW,SQD,SQT,SQX,SS,SS2,SSD,SSF,SSFLIB,SSM,SSS,ST,ST1,ST2,ST26,ST3,ST30,STAR,STC,STER,STK,STM,STMA,STP,STPK,STR,STREAM,STRM,STS,STX,SUN,SVAG,SVG,SVS,SWAG,SWAV,SWD,SWITCH_AUDIO,SX,SXD,SXD1,SXD2,SXD3,SYN,SYNMOD,SZX,TD0,TEC,TF,TF0,TFC,TFD,TFE,TFHD1.5,TFHD7V,TFHDPRO,TFMX,TFMX1.5,TFMX7V,TFMXPRO,TGQ,TGV,THM,THN,THP,THX,TINY,TK5,TLZ,TLZP,TM2,TM8,TMC,TME,TMX,TP,TP1,TP2,TP3,TPU,TRA,TRC,TRD,TRO,TRONIC,TRS,TS,TUN,TW,TWO,TXT,TXTP,TYDSP,UDS,UE4OPUS,ULT,ULW,UM3,UMX,UN2,UNIC,UNIC2,USF,USFLIB,UTK,UV,V0,V1,V2M,V2MZ,VA3,VAG,VAI,VAS,VAWX,VB,VB2,VBK,VDM,VDS,VGM,VGS,VGV,VGZ,VID,VIG,VIS,VMS,VOI,VP6,VPK,VS,VSF,VSS,VSV,VTX,VXN,WAA,WAC,WAD,WAF,WAM,WAS,WAV,WAVC,WAVE,WAVEBATCH,WAVM,WAY,WB,WB2,WBD,WD,WEM,WII,WLF,WMA,WMUS,WN,WOW,WP2,WPD,WSD,WSI,WSR,WUA,WV2,WV6,WVE,WVS,WVX,X,XA,XA2,XA30,XAD,XAG,XAN,XANN,XAU,XAV,XEN,XM,XMA,XMA2,XMD,XMF,XMS,XMU,XNA,XNB,XOPUS,XPK,XPS,XSE,XSEW,XSF,XSM,XSS,XVAG,XVAS,XWAV,XWB,XWC,XWM,XWMA,XWS,XWV,YDSP,YM,YMF,YMST,ZEN,ZIC,ZSD,ZSM,ZSS,ZWDSP,ZWV,ZXZIP\nZintegrowane biblioteki odtwarzaczy:\n- Adplug\n- Another Slight Atari Player(ASAP)\n- AtariSound\n- Eupmini\n- ffmpeg/mpg123/vorbis\n- Game Music Emu\n- FMPmini\n- Gbsplay\n- Highly Complete\n- AHX/Hively tracker\n- LazyUSF\n- Libvgm\n- Mdxplay\n- NSFPlay\n- OpenMPT\n- PlayGSF\n- Pmdmini\n- PxTone / Organya\n- PT3Player\n- SC68\n- Sibplayfp\n- Snes9x/snsf\n- ST-Sound\n- Timidity(używając Merlin_gold SF2 soundfont)\n- UADE\n- XSF (2SF, NCSF)\n- XMP\n-V2M tinyplayer\n- VGMStream\n- VIO2SF\n- WebNEZ\n- WebSID\n- ZXTune\n\nOświadczenie:\nDostęp internetowy do bibliotek Modland, HVSC i ASMA jest świadczony jako usługa bez gwarancji dostępności i/lub funkcjonalności. Użytkuj aplikację na własne ryzyko.";


// ================================
// MARK: - SUPPORT
// ================================

"Mail support" = "Wsparcie e-mail";
"Contact support by email" = "Skontaktuj się ze wsparciem przez e-mail";
"[Please describe your request below]" = "[Opisz swoją prośbę poniżej]";


// ================================
// MARK: - DONATION / TIPS
// ================================

"Thank You! ❤️" = "Dziękuję! ❤️";
"Send a tip to Modizer" = "Wyślij napiwek dla Modizer";
"Support Modizer development" = "Wesprzyj rozwój Modizer";


// ================================
// MARK: - LAUNCH / INITIALIZATION
// ================================

"Cleaning DB & \nreseting settings" = "Czyszczenie bazy danych i \nresetowanie ustawień";
"First launch or issue encountered last time Modizer was running. Apply default settings?" = "Pierwsze uruchomienie lub problem napotkany przy ostatnim uruchomieniu Modizer. Zastosować ustawienia domyślne?";


// ================================
// MARK: - SIRI / APP INTENTS
// ================================

/* Intent Titles */
"Play" = "Odtwórz";
"Pause" = "Pauza";
"Stop" = "Zatrzymaj";
"Next Song" = "Następny utwór";
"Previous Song" = "Poprzedni utwór";
"Play Subsong" = "Odtwórz podtwór";
"Seek" = "Przewiń";
"Set Infinite Loop" = "Ustaw nieskończoną pętlę";
"Set Loop Mode" = "Ustaw tryb pętli";
"Set Shuffle Mode" = "Ustaw tryb losowy";
"Toggle Shuffle" = "Przełącz losowanie";
"Toggle Loop Mode" = "Przełącz tryb pętli";
"Set Fullscreen mode" = "Ustaw tryb pełnoekranowy";
"Go the player view" = "Przejdź do widoku odtwarzacza";
"Set FX" = "Ustaw FX";
"Get Now Playing" = "Pobierz teraz odtwarzane";
"Get Playlists" = "Pobierz listy odtwarzania";
"Play some music" = "Odtwórz muzykę";
"Play most played" = "Odtwórz najczęściej odtwarzane";
"Play favorites" = "Odtwórz ulubione";
"Play Playlist" = "Odtwórz listę odtwarzania";
"Play Playlist By Name" = "Odtwórz listę odtwarzania według nazwy";

/* Intent Descriptions */
"Starts playing music in Modizer." = "Rozpoczyna odtwarzanie muzyki w Modizer.";
"Pauses music playback in Modizer." = "Wstrzymuje odtwarzanie muzyki w Modizer.";
"Stops music playback in Modizer." = "Zatrzymuje odtwarzanie muzyki w Modizer.";
"Skips to the next song in Modizer." = "Przechodzi do następnego utworu w Modizer.";
"Skips to the previous song in Modizer." = "Przechodzi do poprzedniego utworu w Modizer.";
"Plays a specific subsong in the current file." = "Odtwarza określony podtwór w bieżącym pliku.";
"Seeks to a specific position in the current song." = "Przewija do określonej pozycji w bieżącym utworze.";
"Set the infinite loop mode in Modizer." = "Ustawia tryb nieskończonej pętli w Modizer.";
"Set the loop mode in Modizer." = "Ustawia tryb pętli w Modizer.";
"Set the shuffle mode in Modizer." = "Ustawia tryb losowy w Modizer.";
"Toggles shuffle mode in Modizer." = "Przełącza tryb losowy w Modizer.";
"Toggles loop mode in Modizer." = "Przełącza tryb pętli w Modizer.";
"Set Fullscreen mode on or off in Modizer." = "Włącza lub wyłącza tryb pełnoekranowy w Modizer.";
"Go the player view in Modizer." = "Przechodzi do widoku odtwarzacza w Modizer.";
"Set FX mode in Modizer." = "Ustawia tryb FX w Modizer.";
"Gets information about the currently playing song." = "Pobiera informacje o aktualnie odtwarzanym utworze.";
"Gets the list of available playlists in Modizer." = "Pobiera listę dostępnych list odtwarzania w Modizer.";
"Random picks from available local titles in Modizer." = "Losowe wybory z dostępnych lokalnych tytułów w Modizer.";
"Most played titles from available local titles in Modizer." = "Najczęściej odtwarzane tytuły z dostępnych lokalnych tytułów w Modizer.";
"Favorites titles from available local titles in Modizer." = "Ulubione tytuły z dostępnych lokalnych tytułów w Modizer.";
"Plays a specific playlist in Modizer. Note: For best results with voice commands, use 'Play Playlist By Name' instead." = "Odtwarza określoną listę odtwarzania w Modizer. Uwaga: Dla najlepszych wyników z poleceniami głosowymi, użyj zamiast tego 'Odtwórz listę odtwarzania według nazwy'.";
"Plays a playlist by name in Modizer. Recommended for voice commands." = "Odtwarza listę odtwarzania według nazwy w Modizer. Zalecane dla poleceń głosowych.";

/* Parameters */
"Subsong Index" = "Indeks podtworu";
"The index of the subsong to play" = "Indeks podtworu do odtworzenia";
"Position (seconds)" = "Pozycja (sekundy)";
"The position to seek to in seconds" = "Pozycja do przewinięcia w sekundach";
"Relative" = "Względna";
"Whether to seek relative to current position" = "Czy przewijać względem bieżącej pozycji";
"Infinite Loop Mode" = "Tryb nieskończonej pętli";
"0: off, 1: infinite loop" = "0: wył., 1: nieskończona pętla";
"Repeat Mode" = "Tryb powtarzania";
"0: off, 1: loop current title, 2: loop playlist" = "0: wył., 1: zapętl bieżący tytuł, 2: zapętl listę odtwarzania";
"Shuffle Mode" = "Tryb losowy";
"0: off, 1: choose only one title if file has subsongs or is an archive, 2: play all titles of a given file" = "0: wył., 1: wybierz tylko jeden tytuł, jeśli plik ma podtwory lub jest archiwum, 2: odtwórz wszystkie tytuły danego pliku";
"Fullscreen mode" = "Tryb pełnoekranowy";
"Activate (1) or disactivate (0) Fullscreen mode" = "Aktywuj (1) lub dezaktywuj (0) tryb pełnoekranowy";
"FX" = "FX";
"The FX to set" = "FX do ustawienia";
"FX Mode" = "Tryb FX";
"The mode to activate for the selected FX (0:off)" = "Tryb do aktywacji dla wybranego FX (0:wył.)";
"Playlist" = "Lista odtwarzania";
"The playlist to play" = "Lista odtwarzania do odtworzenia";
"Start Index" = "Indeks startowy";
"The index of the song to start playing from (0-based)" = "Indeks utworu, od którego rozpocząć odtwarzanie (od 0)";
"Playlist Name" = "Nazwa listy odtwarzania";
"The name of the playlist to play" = "Nazwa listy odtwarzania do odtworzenia";
"Which playlist would you like to play?" = "Którą listę odtwarzania chcesz odtworzyć?";

/* Dialog Messages */
"play_playlist_dialog" = "Odtwarzanie listy odtwarzania %@";
"Playlist not found. Use 'Get Playlists' to see available playlists." = "Lista odtwarzania nie znaleziona. Użyj 'Pobierz listy odtwarzania', aby zobaczyć dostępne listy.";
"No playlists found" = "Nie znaleziono list odtwarzania";

/* FX Names */
"ProjectM" = "ProjectM";
"Oscillo" = "Oscylo";
"Piano roll" = "Piano roll";
"3D Piano" = "Pianino 3D";
"Notes bars" = "Paski nut";
"Tracker" = "Tracker";
"2D Spectrum" = "Spektrum 2D";
"3D Spectrum" = "Spektrum 3D";
"3D Landscape" = "Krajobraz 3D";

// ================================


// ================================
// MARK: - VOICE COMMANDS UI
// ================================

"Voice Commands" = "Polecenia głosowe";
"Siri voice commands for Modizer" = "Polecenia głosowe Siri dla Modizera";
"Voice Commands: Playback" = "Odtwarzanie";
"Voice Commands: Navigation" = "Nawigacja";
"Voice Commands: Playlists" = "Listy odtwarzania";
"Voice Commands: Modes" = "Tryby";
// MARK: - TABS
// ================================

"Search" = "Szukaj";
"More" = "Więcej";
"Suspend" = "Wstrzymaj";
"Clear all" = "Wyczyść wszystko";
"Online" = "Online";


// ================================
// MARK: - MORE TAB
// ================================

"About" = "O programie";
"Some general informations" = "Ogólne informacje";
"Settings" = "Ustawienia";
"Global, Visu, FTP & Plugins" = "Globalne, wizualizacje, FTP i wtyczki";
"Maintenance" = "Konserwacja";
"Clean DB, Reset ratings, ..." = "Wyczyść bazę danych, resetuj oceny, ...";


// ================================
// MARK: - ONLINE TAB / COLLECTIONS
// ================================

/* Section Headers */
"Collections" = "Kolekcje";
"Browse Internet" = "Przeglądaj Internet";
"Games Music" = "Muzyka z gier";
"Mods & chiptunes" = "Mody i chiptune";
"Other" = "Inne";

/* Collections */
"MODLAND collection" = "Kolekcja MODLAND";
"AMP collection" = "Kolekcja AMP";
"HVSC collection" = "Kolekcja HVSC";
"ASMA collection" = "Kolekcja ASMA";
"JOSHW collection" = "Kolekcja JOSHW";
"VGMRips collection" = "Kolekcja VGMRips";
"SNESmusic collection" = "Kolekcja SNESmusic";
"SMS Power! collection" = "Kolekcja SMS Power!";
"ZXArt collection" = "Kolekcja ZXArt";

/* Collection Descriptions */
"%d entries" = "%d wpisów";
"Thousands of entries" = "Tysiące wpisów";
"4K+ packs / 70K+ songs" = "4K+ paczek / 70K+ utworów";
"1500+ sets / Super Nintendo/Famicom" = "1500+ zestawów / Super Nintendo/Famicom";
"Master System & Game gear sets" = "Zestawy Master System i Game Gear";
"ZX Spectrum" = "ZX Spectrum";

/* Internet */
"Modizer World Charts" = "Światowe listy Modizer";
"Web browser" = "Przeglądarka internetowa";
"No internet connectivity or website down." = "Brak połączenia z Internetem lub strona niedostępna.";

// ================================
// MARK: - SETTINGS - FAMILIES & UI
// ================================

/* Settings Families */
"Global" = "Globalne";
"Default Players" = "Domyślne odtwarzacze";
"Visualizers" = "Wizualizacje";
"PR & NS colors settings" = "Ustawienia kolorów PR i NS";
"Plugins" = "Wtyczki";

/* Player Selection */
"MOD player" = "Odtwarzacz MOD";
"SAP player" = "Odtwarzacz SAP";
"SID player" = "Odtwarzacz SID";
"VGM player" = "Odtwarzacz VGM";
"YM player" = "Odtwarzacz YM";
"NSF player" = "Odtwarzacz NSF";
"PT3 player" = "Odtwarzacz PT3";
"GBS player" = "Odtwarzacz GBS";
"KSS player" = "Odtwarzacz KSS";
"2SF player" = "Odtwarzacz 2SF";
"MIDI player" = "Odtwarzacz MIDI";

/* Global Player Settings - Additional Descriptions */
"Only for plugins supporting this feature (GME, NSFPLAY, LIBVGM)" = "Tylko dla wtyczek obsługujących tę funkcję (GME, NSFPLAY, LIBVGM)";
"0=auto, delay rounded to a multiple of audio buffer size" = "0=auto, opóźnienie zaokrąglone do wielokrotności rozmiaru bufora audio";
"Limited: not for subsong" = "Ograniczone: nie dla podtworów";
"Default value is 3s" = "Wartość domyślna to 3s";
"Default action when selecting an archive or a multisong file" = "Domyślna akcja przy wybieraniu archiwum lub pliku wieloutworowego";
"Play only selected entry or full archive/multisong file" = "Odtwórz tylko wybrany wpis lub całe archiwum/plik wieloutworowy";
"Show Welcome screen" = "Pokaż ekran powitalny";
"Adplug priority for module" = "Priorytet Adplug dla modułu";

/* FTP Settings */
"Server status" = "Status serwera";
"FTP Server" = "Serwer FTP";
"Authorize anonymous" = "Zezwól na anonimowe";
"User" = "Użytkownik";
"Password" = "Hasło";
"Port" = "Port";

/* Online Settings */
"MODLAND URL" = "URL MODLAND";
"HVSC URL" = "URL HVSC";
"ASMA URL" = "URL ASMA";
"MODLAND Server" = "Serwer MODLAND";
"MODLAND cust.URL" = "Własny URL MODLAND";
"HVSC Server" = "Serwer HVSC";
"HVSC cust.URL" = "Własny URL HVSC";
"ASMA Server" = "Serwer ASMA";
"ASMA cust.URL" = "Własny URL ASMA";


// ================================
// MARK: - SETTINGS - ADDITIONAL PLUGIN SETTINGS
// ================================

/* Visualization - MOD Pattern */
"Patterns BG Alpha" = "Przezroczystość tła wzorów";
"Opacity of mod patterns view" = "Krycie widoku wzorów mod";
"MOD Color Theme" = "Motyw kolorów MOD";
"MOD Current Line" = "Bieżąca linia MOD";
"MOD Volume bars" = "Paski głośności MOD";
"MOD Pattern Font" = "Czcionka wzoru MOD";
"MOD Pattern Font Size" = "Rozmiar czcionki wzoru MOD";

/* Visualization - Piano Roll / MIDI */
"Piano Roll FX" = "Efekty Piano Roll";
"PR/Spark FX" = "Efekty PR/Iskier";
"Display voices label" = "Wyświetl etykietę głosów";
"Notes scroller FX" = "Efekty przewijania nut";
"NS/bars mode" = "Tryb NS/pasków";
"NS/bars style" = "Styl NS/pasków";
"Vibrato display" = "Wyświetlanie vibrato";
"Piano FX" = "Efekty pianina";
"Piano bars mode" = "Tryb pasków pianina";

/* Visualization - Spectrum */
"3D Sp.Bloom" = "Rozbłysk spektrum 3D";
"3D Land. Bloom" = "Rozbłysk krajobrazu 3D";
"0: off" = "0: wył.";

/* ProjectM Settings */
"ProjectM FX" = "Efekty ProjectM";
"Rendering quality: Max is pixel resolution, 1/2 is half, ..." = "Jakość renderowania: Maks to rozdzielczość piksela, 1/2 to połowa, ...";
"Custom presets/textures should be copied in .projectm folder" = "Własne presety/tekstury powinny być skopiowane do folderu .projectm";
"Display preset name" = "Wyświetl nazwę presetu";
"Lim: display and disappear quickly" = "Ogr.: wyświetl i szybko zniknij";
"Auto switch presets" = "Automatyczna zmiana presetów";
"Allow loading of milk file with script issues" = "Zezwól na ładowanie plików milk z problemami skryptów";
"Default is 15s" = "Domyślnie 15s";
"Default is 2.7s" = "Domyślnie 2.7s";
"Default value is 32" = "Wartość domyślna to 32";
"Default value is 24" = "Wartość domyślna to 24";
"Default value is 20" = "Wartość domyślna to 20";
"Hardcut" = "Twarde cięcie";
"Hardcut triggers presets switch synchronized with beats." = "Twarde cięcie wyzwala zmianę presetów zsynchronizowaną z rytmem.";
"Hardcut min time" = "Min. czas twardego cięcia";
"Preserve aspect ratio for compatible shaders." = "Zachowaj proporcje obrazu dla kompatybilnych shaderów.";
"Default value is 1" = "Wartość domyślna to 1";
"Hardcut sensitivity" = "Czułość twardego cięcia";

/* Oscilloscope Settings */
"Oscillo FX" = "Efekty oscyloskopu";
"Oscillo show labels" = "Oscyloskop pokaż etykiety";
"Oscillo labels font size" = "Rozmiar czcionki etykiet oscyloskopu";
"Oscillo show grid" = "Oscyloskop pokaż siatkę";
"Oscillo line width" = "Szerokość linii oscyloskopu";
"Reset all custom colors" = "Resetuj wszystkie własne kolory";
"Multi color | System 1" = "Kolor wielobarwny | System 1";
"Multi color | System 2" = "Kolor wielobarwny | System 2";
"Multi color | System 3" = "Kolor wielobarwny | System 3";
"Multi color | System 4" = "Kolor wielobarwny | System 4";
"Multi color | System 5" = "Kolor wielobarwny | System 5";
"Multi color | System 6" = "Kolor wielobarwny | System 6";
"Multi color | System 7" = "Kolor wielobarwny | System 7";
"Multi color | System 8" = "Kolor wielobarwny | System 8";

/* Piano/MIDI Colors */
"Custom color 01" = "Własny kolor 01";
"Custom color 02" = "Własny kolor 02";
"Custom color 03" = "Własny kolor 03";
"Custom color 04" = "Własny kolor 04";
"Custom color 05" = "Własny kolor 05";
"Custom color 06" = "Własny kolor 06";
"Custom color 07" = "Własny kolor 07";
"Custom color 08" = "Własny kolor 08";
"Custom color 09" = "Własny kolor 09";
"Custom color 10" = "Własny kolor 10";
"Custom color 11" = "Własny kolor 11";
"Custom color 12" = "Własny kolor 12";
"Custom color 13" = "Własny kolor 13";
"Custom color 14" = "Własny kolor 14";
"Custom color 15" = "Własny kolor 15";
"Custom color 16" = "Własny kolor 16";
"Custom color 17" = "Własny kolor 17";
"Custom color 18" = "Własny kolor 18";
"Custom color 19" = "Własny kolor 19";
"Custom color 20" = "Własny kolor 20";
"Custom color 21" = "Własny kolor 21";
"Custom color 22" = "Własny kolor 22";
"Custom color 23" = "Własny kolor 23";
"Custom color 24" = "Własny kolor 24";
"Custom color 25" = "Własny kolor 25";
"Custom color 26" = "Własny kolor 26";
"Custom color 27" = "Własny kolor 27";
"Custom color 28" = "Własny kolor 28";
"Custom color 29" = "Własny kolor 29";
"Custom color 30" = "Własny kolor 30";
"Custom color 31" = "Własny kolor 31";
"Custom color 32" = "Własny kolor 32";

/* Plugin Settings - Libopenmpt */
"Libopenmpt" = "Libopenmpt";

/* Plugin Settings - GME */
"GME" = "GME";
"Will skip song if nothing is played for specified duration (0=off)" = "Pominie utwór, jeśli nic nie jest odtwarzane przez określony czas (0=wył.)";

/* Plugin Settings - GSF */
"GSF" = "GSF";

/* Plugin Settings - NSFPLAY */
"NSFPLAY" = "NSFPLAY";
"Default length" = "Domyślna długość";
"Oversampling. Min=0, default: 10" = "Nadpróbkowanie. Min=0, domyślnie: 10";
"Min=off, default: 112" = "Min=wył., domyślnie: 112";
"Max=off, default: 164" = "Maks=wył., domyślnie: 164";
"1/2/3=NTSC/PAL/DENDY\n4/5/6=force NTSC/PAL/DENDY" = "1/2/3=NTSC/PAL/DENDY\n4/5/6=wymuś NTSC/PAL/DENDY";
"Forces IRQ capability for all NSFs, not just NSF2" = "Wymusza możliwość IRQ dla wszystkich NSF, nie tylko NSF2";
"APU unmute on reset" = "APU odcisz przy resetowaniu";
"APU phase reset" = "Reset fazy APU";
"APU non linear mixing" = "Nieliniowe miksowanie APU";
"APU swap duty 1/2" = "APU zamiana cyklu 1/2";
"APU Initialize sweep unmute" = "APU inicjalizuj odciszenie sweep";
"DMC enable $4011 writes" = "DMC włącz zapisy $4011";
"DMC enable periodic noise" = "DMC włącz okresowy szum";
"DMC unmute on reset" = "DMC odcisz przy resetowaniu";
"DMC anti clicking" = "DMC anty-klikanie";
"DMC non linear mixer" = "DMC nieliniowy mikser";
"DMC randomize noise on reset" = "DMC losuj szum przy resetowaniu";
"DMC mute triangle on pitch 0" = "DMC wycisz trójkąt przy tonacji 0";
"prevents high frequency aliasing" = "zapobiega aliasingowi wysokich częstotliwości";
"DMC rand. triangle" = "DMC losowy trójkąt";
"randomize triangle on reset" = "losuj trójkąt przy resetowaniu";
"DMC reverse bits" = "DMC odwróć bity";
"reverse bits of DPCM sample bytes" = "odwróć bity bajtów próbki DPCM";
"MMC5 non linear mixing" = "MMC5 nieliniowe miksowanie";
"MMC5 Phase reset" = "MMC5 reset fazy";
"Reset phase counter after write $5003 and $5007" = "Resetuj licznik fazy po zapisie $5003 i $5007";
"FDS LP filter in Hz" = "Filtr LP FDS w Hz";
"Cutoff frequency (0Hz=off, 2000Hz=default)" = "Częstotliwość odcięcia (0Hz=wył., 2000Hz=domyślnie)";
"FDS reset \"phase\"" = "FDS resetuj \"fazę\"";
"$4085 \"resets\" modular phase" = "$4085 \"resetuje\" fazę modularną";
"FDS write protect" = "FDS ochrona zapisu";
"write protect $8000-DFFF" = "ochrona zapisu $8000-DFFF";
"VRC7 Replace with OPLL" = "VRC7 zamień na OPLL";
"N163 Serial Multiplex mixing" = "N163 miksowanie multipleksowe szeregowe";
"N163 Write Protect Phase" = "N163 ochrona zapisu fazy";
"N163 Limit Wavelength" = "N163 ogranicz długość fali";

/* Plugin Settings - ADPLUG */
"ADPLUG" = "ADPLUG";

/* Plugin Settings - HC (Highly Complete) */
"HC" = "HC";
"Only for HC plugin" = "Tylko dla wtyczki HC";

/* Plugin Settings - SID */
"SID" = "SID";
"Digiboost" = "Digiboost";

/* Plugin Settings - TIMIDITY */
"TIMIDITY" = "TIMIDITY";

/* Plugin Settings - UADE */
"UADE" = "UADE";
"Panning value" = "Wartość panoramowania";
"Gain value" = "Wartość wzmocnienia";

/* Plugin Settings - VGMPlay */
"VGMPLAY" = "VGMPLAY";

/* Plugin Settings - VGMStream */
"VGMSTREAM" = "VGMSTREAM";

/* Plugin Settings - XMP */
"XMP" = "XMP";

/* Plugin Settings - SEXYPSF */
"SEXYPSF" = "SEXYPSF";

/* Plugin Settings - GBSPlay */
"GBS" = "GBS";

/* Plugin Settings - STSOUND */
"STSOUND" = "STSOUND";

/* Plugin Settings - SC68 */
"SC68" = "SC68";

/* Additional Settings */
"Disable" = "Wyłącz";
"Enter playlist name" = "Wprowadź nazwę listy odtwarzania";
"Ask" = "Zapytaj";
"Play All" = "Odtwórz wszystko";
"Single" = "Pojedyncze";
"Archive" = "Archiwum";
"On" = "Wł.";
"Off" = "Wył.";
"Lim" = "Ogr.";

// ================================
// MARK: - PLAYLISTS - ADDITIONAL ENTRIES
// ================================

/* Playlist Menu Entries */
"Add a playlist" = "Dodaj listę odtwarzania";
"Create a new playlist" = "Utwórz nową listę odtwarzania";
"Now playing" = "Teraz odtwarzane";
"1 entry" = "1 wpis";
"No entry" = "Brak wpisów";
"Random picks" = "Losowe wybory";
"Generate a randomized playlist" = "Generuj losową listę odtwarzania";
"Most played" = "Najczęściej odtwarzane";
"Favorites" = "Ulubione";

/* Playlist Actions */
"Add/Remove files..." = "Dodaj/Usuń pliki...";
"More actions..." = "Więcej akcji...";
"Save as a new playlist" = "Zapisz jako nową listę odtwarzania";

// ================================
// MARK: - WELCOME PAGES
// ================================

"Welcome to Modizer!\n" = "Witaj w Modizer!\n";
"Level up your library." = "Podnieś poziom swojej biblioteki.";
"Sound meets visuals." = "Dźwięk spotyka się z wizualizacją.";
"Made with passion,\noffered for free." = "Stworzone z pasją,\noferowane za darmo.";

/* Welcome Page Messages */
"Your gateway to retro and tracker music.\nPower up your device with legendary game tunes, iconic tracker modules, and timeless chiptune classics." = "Twoja brama do muzyki retro i trackerowej.\nWzmocnij swoje urządzenie legendarnymi melodiami z gier, kultowymi modułami trackerowymi i ponadczasowymi klasykami chiptune.";

"Browse and stream from online catalogs, to complete your own collections.\nBuild, edit, and listen to playlists effortlessly." = "Przeglądaj i streamuj z katalogów online, aby uzupełnić własne kolekcje.\nTwórz, edytuj i słuchaj list odtwarzania bez wysiłku.";

"Unlock classic oscilloscope looks, spectrum bars, piano rolls, trackers view and ProjectM/Milkdrop FX. Let Modizer paint each track with motion and color." = "Odblokuj klasyczny wygląd oscyloskopu, paski spektrum, piano roll, widoki trackerów i efekty ProjectM/Milkdrop. Pozwól Modizer pomalować każdy utwór ruchem i kolorem.";

"If you enjoy the app, tips are a great way to support its ongoing development.\nThank you for helping keep Modizer alive and evolving." = "Jeśli podoba Ci się aplikacja, napiwki to świetny sposób wsparcia jej ciągłego rozwoju.\nDziękujemy za pomoc w utrzymaniu Modizer przy życiu i rozwoju.";

"Skip" = "Pomiń";

// ================================
// MARK: - TIPS / DONATIONS
// ================================

/* Tips Screen */
"Support with a Tip" = "Wesprzyj napiwkiem";
"Enjoy Modizer ?" = "Podoba Ci się Modizer?";
"Your support helps keep Modizer running and ad-free!" = "Twoje wsparcie pomaga utrzymać Modizer bez reklam!";
"Already tipped so far" = "Dotychczas przekazano napiwków";
"Thank you for your support! ❤️" = "Dziękujemy za wsparcie! ❤️";

/* Tip Tiers */
"Coffee" = "Kawa";
"Coffee & Croissant" = "Kawa i rogalik";
"Dinner" = "Obiad";
"Loading..." = "Ładowanie...";

/* Tip Actions */
"Confirm Tip" = "Potwierdź napiwek";
"Send Tip" = "Wyślij napiwek";
"Send a %@ tip for %@?" = "Wysłać napiwek %@ za %@?";
"Tip" = "Napiwek";

/* Tip Errors */
"Unable to load products. Please check your internet connection." = "Nie można załadować produktów. Sprawdź połączenie z Internetem.";

/* Thank You Alert */
"Thank You! ❤️" = "Dziękuję! ❤️";
"Your support means everything! Thank you for helping keep Modizer running." = "Twoje wsparcie znaczy wszystko! Dziękuję za pomoc w utrzymaniu Modizer.";

// ================================
// MARK: - MAINTENANCE SCREEN
// ================================

/* Maintenance Actions */
"Clean Database" = "Wyczyść bazę danych";
"Clear 'Now Playing' queue" = "Wyczyść kolejkę 'Teraz odtwarzane'";
"Recreate Samples folder" = "Odtwórz folder Samples";
"Reset settings to default" = "Resetuj ustawienia do domyślnych";
"Remove current cover" = "Usuń bieżącą okładkę";
"Reset Ratings" = "Resetuj oceny";
"Reset Played Counters" = "Resetuj liczniki odtworzeń";
"Reset Database" = "Resetuj bazę danych";
"Clear images cache" = "Wyczyść pamięć podręczną obrazów";

/* Playlists missing files download */
"Download missing playlists files" = "Pobierz brakujące pliki playlist";
"Queue the download of the missing files coming from online collections ?" = "Dodać do kolejki pobieranie brakujących plików z kolekcji online?";
"Download missing files" = "Pobierz brakujące pliki";
"%d missing file(s)" = "Brakujących plików: %d";
"%d missing file(s), %d can be downloaded. Tap to download." = "Brakujących plików: %d, do pobrania: %d. Dotknij, aby pobrać.";
"Supported collections:" = "Obsługiwane kolekcje:";
"Check" = "Sprawdź";
"Checking playlists" = "Sprawdzanie playlist";
"Download manager is not available." = "Menedżer pobierania jest niedostępny.";
"%d file(s) queued for download." = "Plików w kolejce pobierania: %d.";
"%d file(s) already available." = "Plików już dostępnych: %d.";
"%d file(s) not from an online collection." = "Plików spoza kolekcji online: %d.";
"%d file(s) cannot be resolved (%@), browse the collection to download them." = "Nie można ustalić źródła %d plików (%@), przejrzyj kolekcję, aby je pobrać.";

/* Maintenance Messages */
"Settings reseted" = "Ustawienia zresetowane";
"Ratings reseted" = "Oceny zresetowane";
"Played Counters reseted" = "Liczniki odtworzeń zresetowane";
"Samples folder created" = "Utworzono folder Samples";
"Cache cleaned" = "Pamięć podręczna wyczyszczona";
"Database reseted" = "Baza danych zresetowana";
"No cover to remove" = "Brak okładki do usunięcia";
"Cover removed" = "Okładka usunięta";
"Database cleaned" = "Baza danych wyczyszczona";

/* Maintenance Confirmations */
"Are you sure you want to clean the DB, it might take a while ?" = "Czy na pewno chcesz wyczyścić bazę danych, może to chwilę potrwać?";
"Clean" = "Wyczyść";
"Cleaning DB" = "Czyszczenie bazy danych";
"Cancelling..." = "Anulowanie...";

// ================================
// MARK: - PLAYERMENU
// ================================

"Close FX\nwindow" = "Zamknij okno\nFX";
"All FX off" = "Wszystkie FX wył.";
"FX\nalpha" = "Przezr.\nFX";
"Show name\ntemp." = "Pokaż nazwę\nczasowo";
"Show name" = "Pokaż nazwę";
"Bundled\npresets" = "Dołączone\npresety";
"Custom\npresets" = "Własne\npresety";
"Blend\npresets" = "Mieszaj\npresety";
"Clear\nall" = "Wyczyść\nwszystko";
"Select\nall" = "Zaznacz\nwszystko";
"Favorites" = "Ulubione";
"Expand" = "Rozwiń";
"Select\nlisted" = "Zaznacz\nwymienione";
"Remove\nlisted" = "Usuń\nwymienione";
"Selected" = "Zaznaczone";
"Collapse" = "Zwiń";
"Labels" = "Etykiety";
"Grid" = "Siatka";
"Voices\nlabels" = "Etykiety\ngłosów";
"Octaves\nlabels" = "Etykiety\noktaw";
"Volume\nbars" = "Paski\ngłośności";
"Fixed bar" = "Stały pasek";
"BG\nopacity" = "Krycie\ntła";
"Bloom:\n%s" = "Rozbłysk:\n%s";
"Thickness:\n%s" = "Grubość:\n%s";
"Font size\n%s" = "Rozmiar czcionki\n%s";
"Font:\n%s" = "Czcionka:\n%s";
"Info HUD:\n%s" = "Info HUD:\n%s";
"Select active %s presets" = "Wybierz aktywne presety %s";
"bundled" = "dołączone";
"custom" = "własne";
"Select\ncustom\npresets" = "Wybierz\nwłasne\npresety";
"Select\nbundled\npresets" = "Wybierz\ndołączone\npresety";
"Themes:\n%s" = "Motywy:\n%s";



// MARK: - Voice Commands phrases
"Play some music in Modizer" = "Odtwórz muzykę w Modizer";
"Start random playlist in Modizer" = "Uruchom losową playlistę w Modizer";
"Play favorites in Modizer" = "Odtwórz ulubione w Modizer";
"Start favorites playlist in Modizer" = "Uruchom playlistę ulubionych w Modizer";
"Play most played in Modizer" = "Odtwórz najczęściej odtwarzane w Modizer";
"Start most played playlist in Modizer" = "Uruchom playlistę najczęściej odtwarzanych w Modizer";
"Play a playlist in Modizer" = "Odtwórz playlistę w Modizer";
"Start a playlist in Modizer" = "Uruchom playlistę w Modizer";
"Toggle shuffle mode in Modizer" = "Przełącz tryb losowy w Modizer";
"Change shuffle mode in Modizer" = "Zmień shuffle w Modizer";
"Change loop mode in Modizer" = "Zmień tryb powtarzania w Modizer";
"Toggle repeat in Modizer" = "Przełącz powtarzanie w Modizer";
"What's playing in Modizer" = "Co gra w Modizer";
"Current song in Modizer" = "Bieżący utwór w Modizer";

"Voices commands aren't supported in MacOS." = "Polecenia głosowe nie są obsługiwane w systemie macOS.";

/* Error messages */
  "playlist_not_found_error" = "Nie znaleziono playlisty. Użyj 'Pobierz playlisty', aby zobaczyć dostępne playlisty.";
  "playlist_empty_error" = "Ta playlista nie zawiera utworów. Najpierw dodaj muzykę.";

"%@ (name)" = "%@ (nazwa)";
  "%@ (packs)" = "%@ (paczki)";
  "%@ (rating)" = "%@ (ocena)";
  "2D Spectrum settings" = "Ustawienia widma 2D";
  "3D landscape settings" = "Ustawienia krajobrazu 3D";
  "3D spectrum settings" = "Ustawienia widma 3D";
  "Auto\nscaling" = "Auto\nskalowanie";
  "CGSC collection" = "Kolekcja CGSC";
  "CoverLibraryFolder" = "Jako okładka bieżącego folderu biblioteki";
  "Feeling lucky" = "Szczęśliwy traf";
  "Hide MIDI & Piano FX" = "Ukryj FX MIDI i Piano";
  "Hide other note based FX if displayed (Piano, Midi)" = "Ukryj inne efekty FX oparte na nutach, jeśli są wyświetlane (Piano, Midi)";
  "JoshW Covers" = "Okładki JoshW";
  "Limit applied in Radio mode to avoid downloading too big files." = "Limit zastosowany w trybie Radio, aby uniknąć pobierania zbyt dużych plików.";
  "MIDI pattern settings" = "Ustawienia wzorca MIDI";
  "MOD Pattern settings" = "Ustawienia wzorca MOD";
  "Next: %@" = "Następny: %@";
  "Next: loading..." = "Następny: ładowanie...";
  "Piano 3D settings" = "Ustawienia pianina 3D";
  "Piano roll settings" = "Ustawienia piano roll";
  "Radio download limit" = "Limit pobierania w Radio";
  "Radio mode" = "Tryb Radio";
  "Try to download covers from TGDB or MobyGames." = "Spróbuj pobrać okładki z TGDB lub MobyGames."; 

/* Cloud */
  "Add Cloud Source" = "Dodaj źródło w chmurze";
  "Browse iCloud, Dropbox, ..." = "Przeglądaj iCloud, Dropbox, ...";
  "Name this source" = "Nazwij to źródło";
  "Enter a name for this cloud folder" = "Wprowadź nazwę dla tego folderu w chmurze";
  "Cloud Folder" = "Folder w chmurze";
  "Add" = "Dodaj";
  "This cloud folder was added but may not persist after the app is closed. Some cloud providers don't support persistent access." = "Ten folder w chmurze
  został dodany, ale może nie zostać zachowany po zamknięciu aplikacji. Niektórzy dostawcy chmury nie obsługują trwałego dostępu.";
  "File cannot be downloaded.\nPlease check your internet connection." = "Plik nie może zostać pobrany.\nSprawdź swoje połączenie internetowe.";
  "Downloading from\ncloud..." = "Pobieranie z\nchmury...";
  "Download timed out. Please try again later." = "Pobieranie przekroczyło limit czasu. Spróbuj ponownie później.";
  "available" = "dostępne";

"Copy" = "Kopiuj";
"Database couldn't be updated." = "Nie udało się zaktualizować bazy danych.";
"Database updated." = "Baza danych zaktualizowana.";
"Issue %d while copying: %@.\n%@" = "Błąd %d podczas kopiowania: %@.\n%@";
"Old database version: %d.%d. Will update to %d.%d. Please validate & wait." = "Stara wersja bazy danych: %d.%d. Zostanie zaktualizowana do %d.%d. Potwierdź i
 poczekaj.";
"Use STIL data" = "Użyj danych STIL";
"Used for subsongs titles and related artists names." = "Używane do tytułów podutworów i powiązanych nazw artystów.";

